export default [
  {
    name: "北京市",
    city: [
      {
        name: "北京市",
        districtAndCounty: [
          "东城区",
          "西城区",
          "崇文区",
          "宣武区",
          "朝阳区",
          "丰台区",
          "石景山区",
          "海淀区",
          "门头沟区",
          "房山区",
          "通州区",
          "顺义区",
          "昌平区",
          "大兴区",
          "怀柔区",
          "平谷区",
          "密云县",
          "延庆县",
          "延庆镇"
        ]
      }
    ]
  },
  {
    name: "河南省",
    city: [
      {
        name: "郑州市",
        districtAndCounty: [
          "中原区",
          "二七区",
          "管城回族区",
          "金水区",
          "上街区",
          "惠济区",
          "新郑市",
          "登封市",
          "新密市",
          "巩义市",
          "荥阳市",
          "中牟县",
          "城关镇"
        ]
      },
      {
        name: "开封市",
        districtAndCounty: [
          "鼓楼区",
          "龙亭区",
          "顺河回族区",
          "禹王台区",
          "金明区",
          "杞县",
          "城关镇",
          "通许县",
          "城关镇",
          "尉氏县",
          "城关镇",
          "开封县",
          "城关镇",
          "兰考县",
          "城关镇"
        ]
      },
      {
        name: "三门峡市",
        districtAndCounty: [
          "湖滨区",
          "义马市",
          "灵宝市",
          "渑池县",
          "城关镇",
          "陕县",
          "大营镇",
          "卢氏县",
          "城关镇"
        ]
      },
      {
        name: "洛阳市",
        districtAndCounty: [
          "西工区",
          "老城区",
          "瀍河回族区",
          "涧西区",
          "吉利区",
          "洛龙区",
          "偃师市",
          "孟津县",
          "城关镇",
          "新安县",
          "城关镇",
          "栾川县",
          "城关镇",
          "嵩县",
          "城关镇",
          "汝阳县",
          "城关镇",
          "宜阳县",
          "城关镇",
          "洛宁县",
          "城关镇",
          "伊川县",
          "城关镇"
        ]
      },
      {
        name: "焦作市",
        districtAndCounty: [
          "解放区",
          "山阳区",
          "中站区",
          "马村区",
          "孟州市",
          "沁阳市",
          "修武县",
          "城关镇",
          "博爱县",
          "清化镇",
          "武陟县",
          "木城镇",
          "温县",
          "温泉镇"
        ]
      },
      {
        name: "新乡市",
        districtAndCounty: [
          "卫滨区",
          "红旗区",
          "凤泉区",
          "牧野区",
          "卫辉市",
          "辉县市",
          "新乡县",
          "新乡市红旗区",
          "获嘉县",
          "城关镇",
          "原阳县",
          "城关镇",
          "延津县",
          "城关镇",
          "封丘县",
          "城关镇",
          "长垣县",
          "城关镇"
        ]
      },
      {
        name: "鹤壁市",
        districtAndCounty: [
          "淇滨区",
          "山城区",
          "鹤山区",
          "浚县",
          "城关镇",
          "淇县",
          "朝歌镇"
        ]
      },
      {
        name: "安阳市",
        districtAndCounty: [
          "北关区",
          "文峰区",
          "殷都区",
          "龙安区",
          "林州市",
          "安阳县",
          "安阳市北关区",
          "汤阴县",
          "城关镇",
          "滑县",
          "道口镇",
          "内黄县",
          "城关镇"
        ]
      },
      {
        name: "濮阳市",
        districtAndCounty: [
          "华龙区",
          "清丰县",
          "城关镇",
          "南乐县",
          "城关镇",
          "范县",
          "城关镇",
          "台前县",
          "城关镇",
          "濮阳县",
          "城关镇"
        ]
      },
      {
        name: "商丘市",
        districtAndCounty: [
          "梁园区",
          "睢阳区",
          "永城市",
          "虞城县",
          "城关镇",
          "民权县",
          "城关镇",
          "宁陵县",
          "城关镇",
          "睢县",
          "城关镇",
          "夏邑县",
          "城关镇",
          "柘城县",
          "城关镇"
        ]
      },
      {
        name: "许昌市",
        districtAndCounty: [
          "魏都区",
          "禹州市",
          "长葛市",
          "许昌县",
          "许昌市魏都区",
          "鄢陵县",
          "安陵镇",
          "襄城县",
          "城关镇"
        ]
      },
      {
        name: "漯河市",
        districtAndCounty: [
          "源汇区",
          "郾城区",
          "召陵区",
          "舞阳县",
          "舞泉镇",
          "临颍县",
          "城关镇"
        ]
      },
      {
        name: "平顶山市",
        districtAndCounty: [
          "新华区",
          "卫东区",
          "湛河区",
          "石龙区",
          "舞钢市",
          "汝州市",
          "宝丰县",
          "城关镇",
          "叶县",
          "昆阳镇",
          "鲁山县",
          "鲁阳镇",
          "郏县",
          "城关镇"
        ]
      },
      {
        name: "南阳市",
        districtAndCounty: [
          "卧龙区",
          "宛城区",
          "邓州市",
          "南召县",
          "城关镇",
          "方城县",
          "城关镇",
          "西峡县",
          "镇平县",
          "城关镇",
          "内乡县",
          "城关镇",
          "淅川县",
          "社旗县",
          "赊店镇",
          "唐河县",
          "新野县",
          "城关镇",
          "桐柏县",
          "城关镇"
        ]
      },
      {
        name: "信阳市",
        districtAndCounty: [
          "河区",
          "平桥区",
          "息县",
          "城关镇",
          "淮滨县",
          "城关镇",
          "潢川县",
          "光山县",
          "固始县",
          "城关镇",
          "商城县",
          "城关镇",
          "罗山县",
          "城关镇",
          "新县",
          "新集镇"
        ]
      },
      {
        name: "周口市",
        districtAndCounty: [
          "川汇区",
          "项城市",
          "扶沟县",
          "城关镇",
          "西华县",
          "城关镇",
          "商水县",
          "城关镇",
          "太康县",
          "城关镇",
          "鹿邑县",
          "城关镇",
          "郸城县",
          "城关镇",
          "淮阳县",
          "城关镇",
          "沈丘县",
          "槐店镇"
        ]
      },
      {
        name: "驻马店市",
        districtAndCounty: [
          "驿城区",
          "确山县",
          "盘龙镇",
          "泌阳县",
          "泌水镇",
          "遂平县",
          "灈阳镇",
          "西平县",
          "上蔡县",
          "蔡都镇",
          "汝南县",
          "汝宁镇",
          "平舆县",
          "古槐镇",
          "新蔡县",
          "古吕镇",
          "正阳县",
          "真阳镇"
        ]
      },
      {
        name: "济源市",
        districtAndCounty: []
      }
    ]
  },
  {
    name: "上海市",
    city: [
      {
        name: "上海市",
        districtAndCounty: [
          "黄浦区",
          "卢湾区",
          "徐汇区",
          "长宁区",
          "静安区",
          "普陀区",
          "闸北区",
          "虹口区",
          "杨浦区",
          "闵行区",
          "宝山区?",
          "嘉定区",
          "浦东新区",
          "金山区",
          "松江区",
          "青浦区",
          "南汇区",
          "奉贤区",
          "崇明县",
          "城桥镇"
        ]
      }
    ]
  }
];
